# STAR Data on D.C school's performance

In [55]:
import pandas as pd
import numpy as np

from itertools import combinations

In [56]:
path = "../Dataset/"

In [63]:
star_19 = pd.read_excel("../Dataset/OSSEDC/2019/2019 DC School Report Card Aggregate Public Data_.xlsx", sheet_name='STAR Scores')
star_18 = pd.read_csv('../Dataset/OSSEDC/2018/2018_STAR_Score.csv')  
star_19.head()
#star_18.head()

,LEA Code,LEA Name,School Code,School Name,School Type,Ward,STAR Score,STAR Rating,School Year
0,1,District of Columbia Public Schools,175,School-Within-School @ Goding,DCPS,6,88.26,5,2019
1,1,District of Columbia Public Schools,202,Aiton Elementary School,DCPS,7,10.79,1,2019
2,1,District of Columbia Public Schools,203,Amidon-Bowen Elementary School,DCPS,6,48.54,3,2019
3,1,District of Columbia Public Schools,204,Bancroft Elementary School @ Sharpe,DCPS,1,83.01,5,2019
4,1,District of Columbia Public Schools,205,Barnard Elementary School,DCPS,4,73.18,4,2019

In [65]:
star_19.columns = star_19.columns.str.replace(" ", "_")
#star_19 = star_19.drop(['School_Year'], axis=1)

star_18.columns = star_18.columns.str.replace(" ", "_")

star_19.info()
star_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   LEA_Code     206 non-null    int64
 1   LEA_Name     206 non-null    object
 2   School_Code  206 non-null    int64
 3   School_Name  206 non-null    object
 4   School_Type  206 non-null    object
 5   Ward         206 non-null    int64
 6   STAR_Score   206 non-null    float64
 7   STAR_Rating  206 non-null    int64
 8   School_Year  206 non-null    int64
dtypes: float64(1), int64(5), object(3)
memory usage: 14.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 203 entries, 0 to 202
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   LEA_Code     203 non-null    int64
 1   LEA_Name     203 non-null    object
 2   School_Code  203 non-null    int64
 3   School_Name  203 non-null    object
 4   School_Type  203 non-null    object
 5   Ward         203 non-null    int64
 6   STAR_Score   203 non-null    float64
 7   STAR_Rating  203 non-null    int64
 8   ObjectId     203 non-null    int64
dtypes: float64(1), int64(5), object(3)
memory usage: 14.4+ KB

## Merge years together

In [66]:
#star_18.reset_index()
star = star_18[['School_Code', 'STAR_Score', 'STAR_Rating']].merge(star_19[['School_Code', 'STAR_Score', 'STAR_Rating']], on='School_Code', suffixes=('_18', '_19'))
star.head()

   School_Code  STAR_Score_18  STAR_Rating_18  STAR_Score_19  STAR_Rating_19
0          101          48.21               3          56.83               3
1          102          35.63               2          38.37               2
2          109          47.68               3          39.89               2
3          113          35.96               2          57.43               3
4          114          51.40               3          44.31               3

In [74]:
star['STAR_Score_inc'] = star.STAR_Score_18 - star.STAR_Score_19
star['STAR_Score_change'] = star[['STAR_Score_18', 'STAR_Score_19']].pct_change(axis='columns', periods=-1)['STAR_Score_18']
star['STAR_Score_inc'] = star.STAR_Rating_18 - star.STAR_Rating_19
star['STAR_Rating_change'] = star[['STAR_Rating_18', 'STAR_Rating_19']].pct_change(axis='columns', periods=-1)['STAR_Rating_18']

In [75]:
star.head()

,School_Code,STAR_Score_18,STAR_Rating_18,STAR_Score_19,STAR_Rating_19,STAR_Score_inc,STAR_Score_inc(%),STAR_Rating_inc(%),STAR_Score_change(%),STAR_Rating_change(%),STAR_Score_change,STAR_Rating_change
0,101,48.21,3,56.83,3,0,-0.151680,0.000000,-0.151680,0.000000,-0.151680,0.000000
1,102,35.63,2,38.37,2,0,-0.071410,0.000000,-0.071410,0.000000,-0.071410,0.000000
2,109,47.68,3,39.89,2,1,0.195287,0.500000,0.195287,0.500000,0.195287,0.500000
3,113,35.96,2,57.43,3,-1,-0.373846,-0.333333,-0.373846,-0.333333,-0.373846,-0.333333
4,114,51.40,3,44.31,3,0,0.160009,0.000000,0.160009,0.000000,0.160009,0.000000

In [76]:
#turn back to csv file 
star.to_csv("../Dataset/final_data/star.csv")